<?php
# ==================================================================================
# [DATE]  : 2008.12.15			[AUTHOR]  : DOS)K.Yamamoto
# [SYS_ID]: GPRISM				[SYSTEM]  : ÁÈÎ©É¸½àCIM
# [SUB_ID]:						[SUBSYS]  : 
# [PRC_ID]:						[PROCESS] : 
# [PGM_ID]: PS00S06000560.php	[PROGRAM] : ¥Ñ¥Ã¥±¡¼¥¸°ìÍ÷
# [MDL_ID]:						[MODULE]  : 
# ----------------------------------------------------------------------------------
# [COMMENT]
#
# ¢¨PRD_MST¤ËÅÐÏ¿¤µ¤ì¤¿¥Ñ¥Ã¥±¡¼¥¸°ìÍ÷
#
# ----------------------------------------------------------------------------------
# [UPDATE_LOG]
# 
# [UPDATE_PERSON]		[UPDATE]		[COMMENT]
# ====================	==============	============================================
# 
# ----------------------------------------------------------------------------------

$g_PrgCD   = "PS00S06000560";
$g_Version = "2.0";

#===============================================================================
# ÆþÎÏ¥Ñ¥é¥á¡¼¥¿¤Î¼èÆÀ
#===============================================================================
if ($REQUEST_METHOD == "GET") {
	$gw_scr = cnv_formstr($_GET);
} else {
	$gw_scr = cnv_formstr($_POST);
}

#===============================================================================
# ËÜ»ÅÍÍ
#===============================================================================
if ($REQUEST_METHOD == "GET") {
	$g_lang_path = $_GET['l'];		# ¸À¸ì¥Ñ¥¹
	$g_CharSet   = $_GET['c'];		# Ê¸»ú¥³¡¼¥É
}

#===============================================================================
# ¶¦ÄÌ´Ø¿ôÆÉ¹þ
#===============================================================================
require_once(getenv("GPRISM_HOME") . "/DirList_pf.php");	# ¥Ñ¥¹¥ê¥¹¥È

require_once($g_func_dir . "/global.php");					# ¶¦ÄÌÊÑ¿ô
require_once($g_Gfunc_dir . "/Check.php");					# ¶¦ÍÑ¥Á¥§¥Ã¥¯´Ø¿ô

require_once($g_func_dir . "/db_op.php");					# DBÁàºî
require_once($g_func_dir . "/xdb_op.php");					# DBÁàºî(¥ª¡¼¥×¥ó¡¦¥¯¥í¡¼¥ºÀìÍÑ)

require_once($g_func_dir . "/xpt_err_msg.php");				# ¥¨¥é¡¼¥á¥Ã¥»¡¼¥¸À¸À®´Ø¿ô
require_once($g_func_dir . "/xpt_msg_html.php");			# ¥á¥Ã¥»¡¼¥¸½ÐÎÏ´Ø¿ô

require_once($g_Gfunc_dir . "/xpt_screen.php");				# ¥×¥í¥°¥é¥à¥Õ¥ì¡¼¥à
require_once($g_lang_dir . "/buttonM.php");					# ¥Ü¥¿¥óÌ¾¾Î
require_once($g_lang_dir . "/PS00S06000560M.php");			# ¥á¥Ã¥»¡¼¥¸

#===============================================================================
# Äê¿ôÄêµÁ
#===============================================================================
#------------------------------------------------------------------
# É½¼¨ÀßÄê
#------------------------------------------------------------------
define("MAXROW",				$gw_scr['row']);			# ºÇÂçÉ½¼¨¹Ô

$gw_pana_usr_grp_cds = array(
	'DG00S140',
	'DG00S150'
);

$gw_exc_rdg_for_pana = array(
	'RD00SE0'
);

#===============================================================================
# ÇÛÎó¥Ç¡¼¥¿¤ò°ì³çÊÑ´¹
#===============================================================================
function cnv_formstr($array)
{
	foreach ($array as $k => $v) {
		if (is_array($v)) {
			foreach ($v as $kk => $vv) {
				if (is_array($vv)) {
					foreach ($vv as $kkk => $vvv) {
						if (get_magic_quotes_gpc()) {
							$vvv = stripslashes($vvv);
						}

						$array[$k][$kk][$kkk] = $vvv;
					}
				} else {
					if (get_magic_quotes_gpc()) {
						$vv = stripslashes($vv);
					}

					$array[$k][$kk] = $vv;
				}
			}
		} else {
			# ¡Ömagic_quotes_gpc = On¡×¤Î¤È¤­¤Ï¥¨¥¹¥±¡¼¥×²ò½ü
			if (get_magic_quotes_gpc()) {
				$v = stripslashes($v);
			}

			$array[$k] = $v;
		}
	}

	return $array;
}

#===============================================================================
# ½é´ü½èÍý
#===============================================================================
function main_init()
{
	global $gw_scr;
	global $g_msg;
	global $g_err_lv;
	global $g_lang_path;
	global $g_usrId;
	global $gw_exc_rdg_for_pana;
	
	$w_exc_rdg_for_pana = implode("','", $gw_exc_rdg_for_pana);

	scr_mode_chg(1);

	$gw_scr['s_dvsn_cd'] = strtoupper(trim($gw_scr['s_dvsn_cd']));
	$gw_scr['s_usrId'] = strtoupper(trim($gw_scr['s_usrId']));
	
	if(!check_err_code($gw_scr['s_dvsn_cd'])){
		list($g_msg, $g_err_lv) = PS00S06000560_msg("err_Inp_DvsnCd");
		$g_msg = xpt_err_msg($g_msg, PS00S06000560_item("Arg_DvsnCd"), __LINE__);
		return 4000;
	}

	if($gw_scr['s_dvsn_cd'] != ""){
		$w_whr_dvsn = "AND CD IN ( SELECT distinct RDG_CD FROM PRC_MST WHERE DVSN_CD = '{$gw_scr['s_dvsn_cd']}') ";
	}
	
	if($gw_scr['s_usrId'] != "") {
		$w_rtn = is_panasonic_members($gw_scr['s_usrId'], $w_is_pana_member);

		if($w_is_pana_member == 1){
			$w_exc_rdg = "AND CD NOT IN ('{$w_exc_rdg_for_pana}') ";
		}
	}

	#------------------------------------------------------------------
	# SQL©
	#------------------------------------------------------------------
	$w_sql = <<<_SQL

SELECT 
	CD,	
	NM_FLL AS NM
FROM 
	NM_MST 
WHERE 
	TAG = 'RD' AND 
	DEL_FLG = '0'  
	{$w_whr_dvsn}
	{$w_exc_rdg}
_SQL;

	#----------------------------------------------------------------i-
	# ¸¡º÷·ï¿ô
	#------------------------------------------------------------------
	get_rslt_cnt($w_sql, $gw_scr['s_rslt_cnt']);

	#------------------------------------------------------------------
	# ¥Ú¡¼¥¸¾ðÊó¼èÆÀ
	#------------------------------------------------------------------
	get_page_info();

	#------------------------------------------------------------------
	# SQL¼Â¹Ô½àÈ÷
	#------------------------------------------------------------------
	$w_stmt = db_res_set($w_sql);

	#------------------------------------------------------------------
	# SQL¼Â¹Ô
	#------------------------------------------------------------------
	$w_rtn = db_do($w_stmt);
	if ($w_rtn) {
		list($g_msg, $g_err_lv) = PS00S06000560_msg("err_Select");
		$g_msg = xpt_err_msg($g_msg, "", __LINE__);

		return 4000;
	}

	$i = 0;											# ¥Ç¡¼¥¿¼èÆÀÍÑ¥«¥¦¥ó¥¿
	$cnt = 0;										# ¥Ý¥¤¥ó¥¿ÍÑ¥«¥¦¥ó¥¿
	$w_end_pt = $gw_scr['s_sel_page'] * MAXROW;		# ½ªÎ»¥Ý¥¤¥ó¥¿
	$w_start_pt = $w_end_pt - MAXROW + 1;			# ³«»Ï¥Ý¥¤¥ó¥¿

	#------------------------------------------------------------------
	# ¸¡º÷¥Ç¡¼¥¿¼èÆÀ
	#------------------------------------------------------------------
	while ($w_row = db_fetch_row($w_stmt)) {
		$cnt++;

		# ³«»Ï¥Ý¥¤¥ó¥¿¤Þ¤ÇÈô¤Ð¤¹
		if ($w_start_pt > $cnt) {
			continue;
		}
		$i++;

		# ¥Ç¡¼¥¿³ÊÇ¼
		$w_list_nm[$i] = trim($w_row['NM']);
		$w_list_cd[$i] = trim($w_row['CD']);
		# ½ªÎ»¥Ý¥¤¥ó¥¿¤ËÅþÃ£¤¹¤ì¤ÐÈ´¤±¤ë
		if ($w_end_pt == $cnt) {
			break;
		}
	}

	#------------------------------------------------------------------
	# ¥ê¥½¡¼¥¹³«Êü
	#------------------------------------------------------------------
	db_res_free($w_stmt);

	#------------------------------------------------------------------
	# ¹ÔÈÖ¹æÀßÄê
	#------------------------------------------------------------------
	for ($i = 1; $i <= $gw_scr['row']; $i++) {
		$gw_scr['s_rownum'][$i] = $i + (($gw_scr['s_sel_page'] - 1) * $gw_scr['row']);
	}

	#------------------------------------------------------------------
	# É½¼¨¥Ç¡¼¥¿ÀßÄê
	#------------------------------------------------------------------
	$gw_scr['s_list_nm'] = $w_list_nm;
	$gw_scr['s_list_cd'] = $w_list_cd;
	return 0;
}

#==================================================================
# Check the user is the Panasonic and Japan Members
#==================================================================
function is_panasonic_members($w_usr_id,&$r_status)
{
        global $gw_scr;
        global $g_msg;
        global $g_err_lv;
	global $gw_pana_usr_grp_cds;
	$r_status = 1;
	$w_pana_usr_grp_cds = implode("','", $gw_pana_usr_grp_cds );

        $w_sql = <<<_SQL
SELECT 
	COUNT(USR_GRP_CD) COUNT 
FROM 
	USR_GRP_MST 
WHERE 
	USR_ID = '{$w_usr_id}' AND 
	DEL_FLG = 0 AND 
	USR_GRP_CD IN ('{$w_pana_usr_grp_cds}')
_SQL;
        $w_stmt = db_res_set($w_sql);
        $w_rtn = db_do($w_stmt);
        if($w_rtn != 0){
                list($g_msg, $g_err_lv) = msg("err_Sel");
                $g_msg = xpt_err_msg($g_msg, "DEM_TBL", __LINE__);
                return 4000;
        }

        $w_count = -1;
        if($w_row = db_fetch_row($w_stmt)){
                $w_count =  trim($w_row['COUNT']);
	
		if($w_count == 0){
			$r_status = 0;
		}
        }
        db_res_free($w_stmt);

        return 0;
}


#===============================================================================
# ¸¡º÷·ï¿ô¼èÆÀ
#===============================================================================
function get_rslt_cnt($w_sql, &$r_cnt)
{
	global $g_msg;
	global $g_err_lv;

	#------------------------------------------------------------------
	# SQL¼Â¹Ô½àÈ÷
	#------------------------------------------------------------------
	$w_stmt = db_res_set($w_sql);

	#------------------------------------------------------------------
	# SQL¼Â¹Ô
	#------------------------------------------------------------------
	$w_rtn = db_do($w_stmt);
	if ($w_rtn != 0) {
		list($g_msg, $g_err_lv) = PS00S06000560_msg("err_Select");
		$g_msg = xpt_err_msg($g_msg, "", __LINE__);

		return $w_rtn;
	}

	#------------------------------------------------------------------
	# ¸¡º÷·ï¿ô¥«¥¦¥ó¥È
	#------------------------------------------------------------------
	$r_cnt = 0;
	while ($w_row = db_fetch_row($w_stmt)) {
		$r_cnt++;
	}

	#------------------------------------------------------------------
	# ¥ê¥½¡¼¥¹³«Êü
	#------------------------------------------------------------------
	db_res_free($w_stmt);

	return 0;
}

#===============================================================================
# ¥Ú¡¼¥¸¾ðÊó¼èÆÀ
#===============================================================================
function get_page_info()
{
	global $gw_scr;

	#------------------------------------------------------------------
	# ¥È¡¼¥¿¥ë¥Ú¡¼¥¸¿ô¼èÆÀ
	#------------------------------------------------------------------
	$w_ttl_page = ceil($gw_scr['s_rslt_cnt'] / MAXROW);
	$gw_scr['s_maxpage'] = $w_ttl_page;

	for ($i = 1; $i <= $w_ttl_page; $i++) {
	    $gw_scr['s_sel_page_option'][$i] = $i;
	}

	#------------------------------------------------------------------
	# ¥«¥ì¥ó¥È¥Ú¡¼¥¸¼èÆÀ
	#------------------------------------------------------------------
	if ($gw_scr['s_sel_page'] == "") {
	    $gw_scr['s_sel_page'] = 1;
	}
	get_page_no($gw_scr['s_sel_page']);

	#------------------------------------------------------------------
	# ¥Ü¥¿¥óÉ½¼¨¡¿ÈóÉ½¼¨ÀßÄê
	#------------------------------------------------------------------
	if ($gw_scr['s_sel_page'] == 1) {
	    $gw_scr['s_prv_scr_disabled'] = "true";
	}
	if ($gw_scr['s_maxpage'] == 0 || $gw_scr['s_maxpage'] == $gw_scr['s_sel_page']) {
	    $gw_scr['s_nxt_scr_disabled'] = "true";
	}
	
	return 0;
}

#===============================================================================
# ¥«¥ì¥ó¥È¥Ú¡¼¥¸ÈÖ¹æ¼èÆÀ
#===============================================================================
function get_page_no(&$r_page)
{
	global $gw_scr;

	switch ($gw_scr['s_act']) {
		case "PUP":
			$r_page = $r_page - 1;
			break;

		case "PDN":
			$r_page = $r_page + 1;
			break;

		default:
			$r_page = $gw_scr['s_sel_page'];
			break;
	}

	return 0;
}

#===============================================================================
# ½èÍý³«»Ï
#===============================================================================
$gw_rtn = xdb_op_conndb();
if ($gw_rtn != 0) {
	$g_err_lv = 0;
	$g_msg = xpt_err_msg($g_msg, "", __LINE__);
}

#------------------------------------------------------------------
# ¼ç½èÍý
#------------------------------------------------------------------
switch ($g_mode) {
default:
	main_init();
	break;
}

#===============================================================================
# ¥¨¥é¡¼»þ¤Ï¥Ü¥¿¥ó²¡²¼ÉÔ²Ä
#===============================================================================
if ($g_msg != "" && $g_err_lv == 0) {
	$gw_scr['s_prv_scr_disabled'] = "true";
	$gw_scr['s_nxt_scr_disabled'] = "true";
}

#===============================================================================
# ²èÌÌ½ÐÎÏ
#===============================================================================
get_screen(1);


#===============================================================================
# ½èÍý½ªÎ»
#===============================================================================
xdb_op_closedb();
?>
